Catalogs/Стадионы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Стадионы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Команды</xr:Item>
				<xr:Item>Catalog.Города</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Catalog.Команды</xr:Item>
				<xr:Item>Catalog.Города</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЗрителей</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЗрителей</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Стадионы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ВладелецПриИзмененииНаСервере()
	Если ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.Города") Тогда
		Объект.Город = Объект.Владелец;
	ИначеЕсли ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.Команды") Тогда
		Объект.Город = Объект.Владелец.Город;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент=Неопределено)
	ВладелецПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Объект.Ссылка.Пустая() Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	Стадионы.Ссылка КАК Ссылка
		                      |ИЗ
		                      |	Справочник.Стадионы КАК Стадионы
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Города КАК Города
		                      |		ПО Стадионы.Город = Города.Ссылка
		                      |ГДЕ
		                      |	Стадионы.Город = &Город
		                      |	И (Стадионы.Наименование = &Наименование
		                      |			ИЛИ Стадионы.Комментарий ПОДОБНО &Комментарий)");
		Запрос.УстановитьПараметр("Наименование",		Объект.Наименование);
		Запрос.УстановитьПараметр("Комментарий",		"%" + СокрЛП(Объект.Наименование) + "%");
		Запрос.УстановитьПараметр("Город",				Объект.Город);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Уже есть стадион с таким названием", Отказ, Объект.Ссылка, "Наименование");
		Иначе	//Если ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.Команды") Тогда
			Запрос.Текст = "ВЫБРАТЬ
			               |	Стадионы.Ссылка КАК Ссылка
			               |ИЗ
			               |	Справочник.Стадионы КАК Стадионы
			               |ГДЕ
			               |	Стадионы.Владелец = &Владелец";
			Запрос.УстановитьПараметр("Владелец",			Объект.Владелец);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Если ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.Команды") Тогда
					ОбщегоНазначения.СообщитьОбОшибке("У команды уже есть один стадион", Отказ, Объект.Ссылка, "Владелец");
				Иначе
					ОбщегоНазначения.СообщитьОбОшибке("У города уже есть один стадион",, Объект.Ссылка, "Владелец");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВидимостьДоступностьУстановить();
КонецПроцедуры

&НаСервере
Процедура ВидимостьДоступностьУстановить()
	Если ЕстьИстория(Объект.Ссылка) Тогда
		Элементы.Владелец.ТолькоПросмотр			= Истина;
		Элементы.Город.ТолькоПросмотр				= Истина;
	ИначеЕсли ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.Города") Тогда
		Элементы.Город.ТолькоПросмотр				= Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьИстория(Ссылка)
	Возврат СерверныйФункции.ЕстьИстория(Ссылка);
КонецФункции
